# customer-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-customer/runs/run-u8hviRctNPiaxtuS

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=staging-cockroachdb-serverless-cluster-id]
module.database.cockroach_database.default: Refreshing state... [id=3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c:staging-customer]
module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c:staging-customer-database-migration]
module.database.cockroach_database.default: Drift detected (delete)
module.database_migration_user.cockroach_sql_user.default: Drift detected (delete)
╷
│ Warning: Cluster not found
│
│   with module.database_migration_user.cockroach_sql_user.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database_user/resources.tf line 14, in resource "cockroach_sql_user" "default":
│   14: resource "cockroach_sql_user" "default" {
│
│ SQL User's parent cluster with clusterID
│ 3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c is not found. Removing from state.
╵
╷
│ Warning: Cluster not found
│
│   with module.database.cockroach_database.default,
│   on ../../../../../shared/infrastructure/modules/serverless_database/resources.tf line 5, in resource "cockroach_database" "default":
│    5: resource "cockroach_database" "default" {
│
│ Database's parent cluster with clusterID
│ 3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c is not found. Removing from state.
╵

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.database.cockroach_database.default has been deleted
  - resource "cockroach_database" "default" {
      - id         = "3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c:staging-customer" -> null
      - name       = "staging-customer" -> null
        # (1 unchanged attribute hidden)
    }

  # module.database_migration_user.cockroach_sql_user.default has been deleted
  - resource "cockroach_sql_user" "default" {
        id         = "3c7fa2f1-bf5d-4aea-b66a-9ecb7e924e9c:staging-customer-database-migration"
      - name       = "staging-customer-database-migration" -> null
      - password   = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.database.cockroach_database.default will be created
  + resource "cockroach_database" "default" {
      + cluster_id  = (sensitive value)
      + id          = (known after apply)
      + name        = "staging-customer"
      + table_count = (known after apply)
    }

  # module.database_migration_user.data.aws_ssm_parameter.cluster_id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "cluster_id" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "staging-cockroachdb-serverless-cluster-id"
      + type    = (known after apply)
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-customer-database-migration"
    }

  # module.database_migration_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "staging-customer-database-migration"
      + password   = (sensitive value)
    }

  # module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "b8b369ed-9bad-40aa-b7ed-9feb92fe8034" -> "997da1b4-737c-4dda-bd83-9f5cfe4c9e81"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.shared_common.module.cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "staging-cockroachdb-serverless-cluster-id"
      + tags           = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tags_all       = {
          + "environment"   = "staging"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.shared_common.module.cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "staging-shared"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "ap-southeast-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*